//Найдите количество четных цифр данного натурального числа
package com.jb;

import java.util.Scanner;

public class Task2_15 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите целое число:");
        String s = scanner.nextLine();
    }
}
